/**/
"Cancel" = "Avbryt";
/**/
"Delete" = "Slett";
/**/
"Open" = "Åpne";
/**/
"Edit" = "Rediger";
/**/
"Yes" = "Ja";
/**/
"Finish" = "Fullfør";
/**/
"Done" = "Ferdig";
/**/
"Save" = "Lagre";
/**/
"Undo" = "Angre";
/**/
"Redo" = "Gjør om";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Ja, slett";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Bruk geometri";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Fjern geometri";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Slett knekkpunkt";
/*Geometry Edit Action Name*/
"Insert Part" = "Sett inn del";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Sett inn knekkpunkt";
/*Geometry Edit Action Name*/
"Move Vertex" = "Flytt knekkpunkt";
/*Geometry Edit Action Name*/
"Remove Part" = "Fjern del";

/*Collecting attachments*/
"Add" = "Legg til";
/*Collecting attachments*/
"Take Photo or Video" = "Ta foto eller video";
/*Collecting attachments*/
"Choose From Library" = "Velg fra bibliotek";
/*Collecting attachments*/
"Photo" = "Foto";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "Lagre i fotobibliotek";
/*Collecting attachments*/
"Download" = "Last ned";

/*Date attribute*/
"Today" = "I dag";

/**/
"Attachments" = "Vedlegg";
"Attributes" = "Attributter";

/**/
"Open in Safari" = "Åpne i Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Oppgi et tall mellom %i og %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Angi et tall mellom %@ og %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "For mange tegn (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Tallet er utenfor akseptabelt verdiområde.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Felttypen støttes ikke";

/**/
"%d of %d" = "%d av %d";

/**/
"Changing Feature Type" = "Endrer geoobjekttype";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Du endrer geoobjekttypen. Det kan muligens overskrive enkelte feltverdier. Er du sikker på at du vil gjøre dette?";

/**/
"Deleting Feature" = "Sletter geoobjekt";
"Are you sure you want to delete this feature?" = "Er du sikker på at du vil slette dette geoobjektet?";

/**/
"Data for pie chart is invalid" = "Ugyldige data for sektordiagram";
"No data to create a pie chart" = "Ingen data å opprette et sektordiagram fra";
"No image to display" = "Ingen bilder kan vises";

/**/
"Created by %@ seconds ago" = "Opprettet av %@ for sekunder siden";

/**/
"Created by %@ a minute ago" = "Opprettet av %@ for et minutt siden";

/**/
"Edited by %@ seconds ago" = "Redigert av %@ for sekunder siden";

/**/
"Edited by %@ a minute ago" = "Redigert av %@ for et minutt siden";

/**/
"Created seconds ago" = "Opprettet for sekunder siden";

/**/
"Created a minute ago" = "Opprettet for et minutt siden";

/**/
"Edited seconds ago" = "Redigert for sekunder siden";

/**/
"Edited a minute ago" = "Redigert for et minutt siden";

/**/
"Created by %@ %d minutes ago" = "Opprettet av %@ for %d minutter siden";

/**/
"Created by %@ an hour ago" = "Opprettet av %@ for en time siden";

/**/
"Created by %@ %d hours ago" = "Opprettet av %@ for %d timer siden";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Opprettet av %@ %@ %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Opprettet av %@ %@ %@";

/**/
"Edited by %@ %d minutes ago" = "Redigert av %@ for %d minutter siden";

/**/
"Edited by %@ an hour ago" = "Redigert av %@ for en time siden";

/**/
"Edited by %@ %d hours ago" = "Redigert av %@ for %d timer siden";

/**/
"Edited by %@ on %@ at %@ - day" = "Redigert av %@ %@ %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Redigert av %@ %@ %@";

/**/
"Created by %@" = "Opprettet av %@";

/**/
"Edited by %@" = "Redigert av %@";

/**/
"Created %d minutes ago" = "Opprettet for %d minutter siden";

/**/
"Created an hour ago" = "Opprettet for en time siden";

/**/
"Created %d hours ago" = "Opprettet for %d timer siden";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Opprettet %@ %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Opprettet %@ %@";

/**/
"Edited %d minutes ago" = "Redigert for %d minutter siden";

/**/
"Edited an hour ago" = "Redigert for en time siden";

/**/
"Edited %d hours ago" = "Redigert for %d timer siden";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Redigert %@ %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Redigert %@ %@";

/* Used to denote a required field */
"Required" = "Obligatorisk";

/* Used for naming layers with no names */
"Layer %d" = "Kartlag %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Finner ikke adresse for lokasjon";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Finner ikke lokasjon for adresse";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Kan ikke lese adresse";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Finner ikke filen";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Kan ikke laste posisjonsindikator";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Intern feil i posisjonsindikator";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Posisjonsindikatoren støtter ikke geokoding av krysningspunkt";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Ugyldige egenskaper for posisjonsindikator";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Påkrevd felt mangler";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Posisjonsindikatoren er ikke startet";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Posisjonsindiktatorformatet støttes ikke";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Projeksjonsendringen støttes ikke";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Geografisk referanse støttes ikke";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Motsatt geokoding støttes ikke med denne lokasjonstjensten.";

/* Network analyst errors */
"Cannot open network." = "Kan ikke åpne nettverk.";
"Cannot retrieve route task parameters." = "Kan ikke hente parameterne for ruteoppgave.";
"Insufficient number of stops." = "Det er for få stopp.";
"Stop (%@) was not located." = "Finner ikke stoppet (%@).";
"Stop (%@) is located on a non traversable element." = "Stoppet (%@) befinner seg på et geoobjekt som ikke kan krysses.";
"Stop (%@) is located on a soft restricted element." = "Stoppet (%@) er på et element med lav restriksjon.";
"Point barrer (%@) was not located." = "Finner ikke punkthindringen (%@).";
"Point barrier (%@) has invalid added cost attribute name." = "Punkthindringen (%@) har ugyldig attributtnavn for tilleggskostnad.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Linjehindringen (%@) har ugyldig attributtnavn for gradert kostnad.";
"Line barrier (%@) does not cover any network elements." = "Linjehindringen (%@) dekker ingen nettverkselementer.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Polygonhindringen (%@) har ugyldig attributtnavn for gradert kostnad.";
"Polygon barrier (%@) does not cover any network elements." = "Polygonhindringen (%@) dekker ingen nettverkselementer.";
"'%@' is an invalid impedance attribute." = "'%@' har et ugyldig impedansattributt.";
"'%@' restriction attribute is invalid." = "Restriksjonsattributtet '%@' er ugyldig.";
"'%@' accumulate attribute is invalid." = "Akkumuleringsattributtet '%@' er ugyldig.";
"'%@' is an invalid directions time attribute." = "'%@' er et ugyldig tidsattributt for veibeskrivelse.";
"Directions distance attribute is invalid." = "Ugyldig avstandsattributt for veibeskrivelse.";
"Invalid attribute parameter attribute name (%@)." = "Ugyldig attributtnavn (%@) for attributtparameter.";
"Invalid attribute parameter parameter name (%@)." = "Ugyldig parameternavn (%@) for attributtparameter.";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Ugyldig verditype for attributtet (%1$@) parameteren (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Ugyldig verdi for restriksjonsbruk for attributtet (%1$@) parameteren (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Nøytral verdi for restriksjonsbruk for attributtet (%1$@) parameteren (%2$@).";
"Soft restricted element (%@) was traversed." = "Element med lav restriksjon (%@) ble krysset.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Nettverket har ikke et hierarkiattributt for hierarkisk ruteplanlegging.";
"No path can be found between a given pair of stops (%@)." = "Finner ingen bane mellom et gitt par med stopp (%@).";
"The input spatial reference is undefined." = "Udefinert geografisk referanse i inndata.";
"The output spatial reference is undefined." = "Udefinert geografisk referanse i utdata.";
"The directions style is invalid." = "Ugyldig stil for veivbeskrivelse.";
"The directions language is invalid." = "Ugyldig språk for veibeskrivelse.";
"Directions time and distance attributes do not match." = "Tids- og avstandsattributtene for veibeskrivelse samsvarer ikke.";
"The directions road class attribute is invalid." = "Ugyldig veiklasseattributt for veibeskrivelse.";
"Unknown condition." = "Ukjent betingelse.";
"Invalid route task parameters." = "Ugyldige parametere for ruteoppgave.";
"Route task's solution cannot be found." = "Finner ingen løsning på ruteoppgave.";
"Route task was cancelled." = "Ruteoppgaven ble avbrutt.";
"Route task internal error." = "Intern feil i ruteoppgave.";
"Route name property is not supported for local route task." = "Rutenavnegenskapen støttes ikke for lokal ruteoppgave.";
"Local route task parameters should be retrieved from route task." = "Parameterne for lokal ruteoppgave skal hentes fra ruteoppgave.";
"Cannot retrieve network description." = "Kan ikke hente nettverksbeskrivelse.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Kun ett lengdeattributt kan angis for impedanceAttributeName og accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Kun ett tidsattributt kan angis for impedanceAttributeName og accumulateAttributeNames.";
"Service not supported." = "Tjenesten støttes ikke.";
"Specified start time occurs before January 1, 1970." = "Angitt starttidspunkt ligger før 1. januar 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Stopp (%@) har et starttidspunkt som ligger før 1. januar 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Stopp (%@) har et lokalt tidsvindu som starter før 1. januar 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Stopp (%@) har et UTC-tidsvindu som starter før 1. januar 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "Stopp (%@) har et tidsvindu der sluttidspunktet ligger før starttidspunktet.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "tm";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pkt.";
"Unknown" = "Ukjent";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centimeter";
"Decimal Degrees" = "Desimalgrader";
"Decimeters" = "Desimeter";
"Feet" = "Fot";
"Inches" = "Tommer";
"Kilometers" = "Kilometer";
"Meters" = "Meter";
"Miles" = "Miles";
"Millimeters" = "Millimeter";
"Nautical Miles" = "Nautiske mil";
"Points" = "Punkter";
"Yards" = "Yard";

/* Area Units Abbreviated Strings */
"sq. in" = "tommer²";
"sq. ft" = "fot²";
"sq. yd" = "yard²";
"ac" = "ac";
"sq. mi" = "mile²";
"sq. mm" = "mm2";
"sq. cm" = "cm²";
"sq. dm" = "dm²";
"sq. m" = "m²";
"ares" = "ar";
"ha" = "ha";
"sq. km" = "km²";

/* Area Units Display Strings */
"Square Inches" = "Kvadrattommer";
"Square Feet" = "Kvadratfot";
"Square Yards" = "Kvadratyard";
"Acres" = "Acre";
"Square Miles" = "Kvadratmiles";
"Square Millimeters" = "Kvadratmillimeter";
"Square Centimeters" = "Kvadratcentimeter";
"Square Decimeters" = "Kvadratdesimeter";
"Square Meters" = "Kvadratmeter";
"Ares" = "Ar";
"Hectares" = "Hektar";
"Square Kilometers" = "Kvadratkilometer";

/* Errors */
"Error" = "Feil";
"Class not @protocol AGSJSONSerializable compliant" = "Klassen er ikke kompatibel med @protocol AGSJSONSerializable";
"Authorization required" = "Krever godkjenning";
"Token is invalid or has expired" = "Token er ugyldig eller utløpt";
"Unknown error occurred" = "Det oppstod en ukjent feil";
"Empty username/password" = "Tomt brukernavn/passord";
"Token URL is nil. You must set a valid token URL on the credential." = "Token-URL er null. Du må angi en gyldig token-URL i legitimasjonen.";
"Unknown authentication error" = "Ukjent godkjenningsfeil";
"Error extracting identity" = "Feil under uttrekking av identitet";
"Error adding identity to the keychain" = "Feil ved tillegging av identitet i nøkkelringen";
"Invalid Credentials" = "Feil påloggingsdetaljer";
"Bad URL." = "Ugyldig URL.";
"The feature layer does not expose an object-id field." = "Geoobjektlaget viser ikke et objekt-ID-felt.";
"Both geodatabase and syncParams are required for this method." = "Denne metoden krever både geodatabase og syncParams.";
"Uploading deltas is not supported with this replica." = "Denne kopien støtter ikke opplasting av detaljer.";
"Error creating delta geodatabase" = "Feil ved oppretting av deltageodatabase";
"Unable to create result image layer" = "Kan ikke opprette resultatbildelag";
"Cache at path '%@' not found." = "Finner ikke buffer med banen '%@'.";
"To add an item, you must be logged in to the portal." = "Du må være logget på portalen for å legge til et element.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Du må angi en verdi i AGSPortalItemContentParameters for å legge til et element.";
"The portal failed to add the item." = "Portalen la ikke til elementet.";
"To delete an item, you must be logged in to the portal." = "Du må være logget på portalen for å slette et element.";
"The portal failed to delete the item." = "Portalen slettet ikke elementet.";
"To update an item, an itemId and logged in user are required." = "Oppdatering av element krever itemID og at brukeren er pålogget.";
"The item failed to update." = "Elementet ble ikke oppdatert.";
"The item failed to update JSON." = "Elementet oppdatert ikke JSON.";
"You must be logged in to a portal to add a comment." = "Du må være logget på portalen for å legge til en kommentar.";
"The comment failed to be added." = "Kommentaren ble ikke lagt til.";
"You must be logged in to a portal to fetch the current user's rating." = "Du må være logget på portalen for å hente gjeldende brukers vurdering.";
"You must be logged in to a portal to add a rating." = "Du må være logget på portalen for å legge til en vurdering.";
"The rating failed to be added." = "Vurderingen ble ikke lagt til.";
"To share an item, you must be logged in to the portal." = "Du må være logget på portalen for å dele et element.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Hvis du vil oppheve delingen av et element, må du være logget på portalen og angi gruppene som du vil oppheve delingen for.";
"Bad Request" = "Ugyldig forespørsel";
"Credential Required" = "AGSCredential er påkrevd";
"Job not created" = "Jobben ble ikke opprettet";
"Service did not return a valid URL" = "Tjenesten returnerte ikke en gyldig URL";
"Service did not return a file" = "Tjenesten returnerte ikke en fil";
"Service did not return a size" = "Tjenesten returnerte ikke en størrelse";
"Job failed" = "Jobben mislyktes";
"Job timed out" = "Jobben fikk tidsavbrudd";
"Job was cancelled" = "Jobben ble avbrutt";
"Job was deleted" = "Jobben ble slettet";
"Feature with objectId: %d not found" = "Finner ikke geoobjekt med objectId: %d";
"No object-id values specified for feature table query." = "Ingen objekt-ID-verdier ble angitt for geoobjektstabellsøket.";

/* OAuth */
"The specified clientID is invalid" = "Den angitte clientID er ugyldig";

/* Sync */
"Upload is not supported with this service." = "Opplasting støttes ikke på denne tjenesten.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Hvis du vil utføre en synkronisering, må du angi en annen synkroniseringsretning enn AGSGDBSyncDirectionNone.";